       01 ACCOUNT-RECORD.
          05 ACCT-ID               PIC 9(6).
          05 ACCT-NAME             PIC X(60).
          05 ACCT-BALANCE          PIC S9(9)V99 COMP-3.