      ******************************************************************
      * COPYBOOK: CLIENTE.CPY
      * Descripción:
      *     Estructura compartida para la información de un cliente.
      ******************************************************************

       01 WS-CLIENTE.

           05 WS-ID                 PIC 9(5).

           05 WS-NOMBRE             PIC X(50).

           05 WS-APELLIDO           PIC X(50).

           05 WS-EMAIL              PIC X(100).