       01 PRODUCT-RECORD.
           05 PROD-ID           PIC X(5).
           05 PROD-NAME         PIC X(20).
           05 PROD-STOCK        PIC 9(5).
           05 PROD-MIN-STOCK    PIC 9(5).
           05 PROD-MAX-STOCK    PIC 9(5).