      ******************************************************************
      * COPYBOOK: TRANSACTION.CPY
      * Description:
      *   Transaction Record Layout
      ******************************************************************

       01 TRANSACTION-RECORD.

      *---------------------------------------------------------------*
      * Account Information
      *---------------------------------------------------------------*

           05 TR-ACCOUNT-ID             PIC 9(6).

      *---------------------------------------------------------------*
      * Transaction Information
      *---------------------------------------------------------------*

           05 TR-TYPE                   PIC X.
              88 TR-DEPOSIT                  VALUE 'D'.
              88 TR-WITHDRAWAL               VALUE 'W'.
              88 TR-TRANSFER                 VALUE 'T'.
              88 TR-INVALID                  VALUE SPACE.

           05 TR-AMOUNT                 PIC 9(11)V99.

      *---------------------------------------------------------------*
      * Transaction Date
      *---------------------------------------------------------------*

           05 TR-DATE.

              10 TR-YEAR               PIC 9(4).
              10 TR-MONTH              PIC 99.
              10 TR-DAY                PIC 99.

      *---------------------------------------------------------------*
      * Reference Information
      *---------------------------------------------------------------*

           05 TR-REFERENCE             PIC X(20).

      *---------------------------------------------------------------*
      * Processing Status
      *---------------------------------------------------------------*

           05 TR-STATUS                PIC X.
              88 TR-PENDING                 VALUE 'P'.
              88 TR-PROCESSED              VALUE 'R'.
              88 TR-ERROR                  VALUE 'E'.

      *---------------------------------------------------------------*
      * Reserved
      *---------------------------------------------------------------*

           05 TR-RESERVED              PIC X(20).